# Installation
#
# /usr/bin/ruby -e "$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/master/install)"
# brew tap homebrew/bundle
# brew tap homebrew/cask-versions
# brew tap heroku/brew
# brew bundle

brew 'coreutils'
brew 'automake'

brew 'bind'
brew 'gnupg2'
brew 'the_silver_searcher'
brew 'tree'
brew 'ctags'
brew 'wrk'
brew 'cloc'
brew 'scc'
brew 'mkcert'
brew 'nss' # mkcert + Firefox

brew 'ruby-install'
brew 'chruby'
brew 'direnv'
brew 'node'
brew 'npm'
brew 'yarn'

brew 'git'
brew 'git-lfs'
brew 'gh'

brew 'go'
brew 'python3'

brew 'neovim'
brew 'tmux'

brew 'highlight'
brew 'graphviz'
brew 'plantuml'
brew 'hugo'

brew 'postgresql'
brew 'mysql'
brew 'redis'

brew 'circleci'
brew 'awscli'
cask 'google-cloud-sdk'
cask 'phantomjs'

brew 'lame'
